## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 58 to add, 18 to change, 58 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.pomerium_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "pomerium_policies"  {
      ~ id      = "907543863" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/session_key",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/session_cookie_secret",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id",
              - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret",
              - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id",
              - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret",
              - "arn:aws:ssm:ca-central-1:794722365809:parameter/session_cookie_secret",
              - "arn:aws:ssm:ca-central-1:794722365809:parameter/session_key",
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.pomerium_sso_proxy_auth_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "pomerium_sso_proxy_auth_container_definition"  {
      ~ id       = "d6013933e5cddd74cca3df871fc9103294f2f3f438fb75ef911661d6f978d453" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "IDP_PROVIDER"
                          - value = "google"
                        },
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "debug"
                        },
                    ]
                  - essential        = true
                  - image            = "pomerium/verify:sha-6b38dd5"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/pomerium_sso_proxy_auth"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "pomerium_sso_proxy_auth-task"
                        }
                    }
                  - name             = "pomerium_sso_proxy_auth"
                  - portMappings     = [
                      - {
                          - ContainerPort = 8000
                          - Protocol      = "tcp"
                          - hostPort      = 8000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SHARED_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id"
                        },
                      - {
                          - name      = "COOKIE_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret"
                        },
                      - {
                          - name      = "IDP_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id"
                        },
                      - {
                          - name      = "IDP_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "POMERIUM_CLIENT_ID"            = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id" -> (known after apply)
          ~ "POMERIUM_CLIENT_SECRET"        = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret" -> (known after apply)
          ~ "POMERIUM_GOOGLE_CLIENT_ID"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id" -> (known after apply)
          ~ "POMERIUM_GOOGLE_CLIENT_SECRET" = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret" -> (known after apply)
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.pomerium_sso_proxy_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "pomerium_sso_proxy_container_definition"  {
      ~ id       = "730508e5a25c70eb3ee65487c57c8ba0331b48d5e1f4680d27bcd2de76533a17" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "AUTHENTICATE_SERVICE_URL"
                          - value = "https://auth.security.cdssandbox.xyz"
                        },
                      - {
                          - name  = "AUTOCERT"
                          - value = "FALSE"
                        },
                      - {
                          - name  = "COOKIE_EXPIRE"
                          - value = "8h"
                        },
                      - {
                          - name  = "IDP_PROVIDER"
                          - value = "google"
                        },
                      - {
                          - name  = "INSECURE_SERVER"
                          - value = "true"
                        },
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "debug"
                        },
                      - {
                          - name  = "ROUTES"
                          - value = "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMK"
                        },
                    ]
                  - essential        = true
                  - image            = "pomerium/pomerium:git-74310b3d"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/pomerium_sso_proxy"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "pomerium_sso_proxy-task"
                        }
                    }
                  - name             = "pomerium_sso_proxy"
                  - portMappings     = [
                      - {
                          - ContainerPort = 443
                          - Protocol      = "tcp"
                          - hostPort      = 443
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SHARED_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id"
                        },
                      - {
                          - name      = "COOKIE_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret"
                        },
                      - {
                          - name      = "IDP_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id"
                        },
                      - {
                          - name      = "IDP_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "POMERIUM_CLIENT_ID"            = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id" -> (known after apply)
          ~ "POMERIUM_CLIENT_SECRET"        = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret" -> (known after apply)
          ~ "POMERIUM_GOOGLE_CLIENT_ID"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id" -> (known after apply)
          ~ "POMERIUM_GOOGLE_CLIENT_SECRET" = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret" -> (known after apply)
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_acm_certificate.internal_domain will be updated in-place
  ~ resource "aws_acm_certificate" "internal_domain" {
        id                        = "arn:aws:acm:ca-central-1:794722365809:certificate/fd72956c-0bf0-4fae-91e4-372e5e0ef85f"
      ~ tags                      = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                  = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_group.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "pomerium_sso_proxy" {
        id                = "/aws/ecs/pomerium_sso_proxy"
        name              = "/aws/ecs/pomerium_sso_proxy"
      ~ tags              = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.pomerium_sso_proxy_auth will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "pomerium_sso_proxy_auth" {
        id                = "/aws/ecs/pomerium_sso_proxy_auth"
        name              = "/aws/ecs/pomerium_sso_proxy_auth"
      ~ tags              = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.sso_proxy_waf will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "sso_proxy_waf" {
        id                = "/aws/kinesisfirehose/sso_proxy_waf"
        name              = "/aws/kinesisfirehose/sso_proxy_waf"
      ~ tags              = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_cluster.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_ecs_cluster" "pomerium_sso_proxy" {
        id                 = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy"
        name               = "pomerium_sso_proxy"
      ~ tags               = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all           = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_cluster.pomerium_sso_proxy_auth will be updated in-place
  ~ resource "aws_ecs_cluster" "pomerium_sso_proxy_auth" {
        id                 = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy_auth"
        name               = "pomerium_sso_proxy_auth"
      ~ tags               = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all           = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_service" "pomerium_sso_proxy" {
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy/pomerium_sso_proxy" -> (known after apply)
        name                               = "pomerium_sso_proxy"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      ~ tags                               = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                           = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:6" -> (known after apply)
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer { # forces replacement
          - container_name   = "pomerium_sso_proxy" -> null
          - container_port   = 443 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/ecs/4b1c2569265c960c" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "pomerium_sso_proxy"
          + container_port   = 443
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-078dc7b81a1f5418d",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-030be0f8486685e8c",
              - "subnet-069929ff9e2951a84",
              - "subnet-0fd5187df16a03f6c",
            ] -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_ecs_service.pomerium_sso_proxy_auth must be replaced
-/+ resource "aws_ecs_service" "pomerium_sso_proxy_auth" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy_auth/pomerium_sso_proxy_auth" -> (known after apply)
        name                               = "pomerium_sso_proxy_auth"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      ~ tags                               = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                           = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy_auth:1" -> (known after apply)
        # (9 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-078dc7b81a1f5418d",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-030be0f8486685e8c",
              - "subnet-069929ff9e2951a84",
              - "subnet-0fd5187df16a03f6c",
            ] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ service_registries {
          - container_port = 0 -> null
          - port           = 0 -> null
          ~ registry_arn   = "arn:aws:servicediscovery:ca-central-1:794722365809:service/srv-e7jhv6q4gmws2guf" -> (known after apply) # forces replacement
        }
    }

  # aws_ecs_task_definition.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AUTHENTICATE_SERVICE_URL"
                          - value = "https://auth.security.cdssandbox.xyz"
                        },
                      - {
                          - name  = "AUTOCERT"
                          - value = "FALSE"
                        },
                      - {
                          - name  = "COOKIE_EXPIRE"
                          - value = "8h"
                        },
                      - {
                          - name  = "IDP_PROVIDER"
                          - value = "google"
                        },
                      - {
                          - name  = "INSECURE_SERVER"
                          - value = "true"
                        },
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "debug"
                        },
                      - {
                          - name  = "ROUTES"
                          - value = "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMK"
                        },
                    ]
                  - essential        = true
                  - image            = "pomerium/pomerium:git-74310b3d"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/pomerium_sso_proxy"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "pomerium_sso_proxy-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "pomerium_sso_proxy"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SHARED_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id"
                        },
                      - {
                          - name      = "COOKIE_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret"
                        },
                      - {
                          - name      = "IDP_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id"
                        },
                      - {
                          - name      = "IDP_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "pomerium_sso_proxy" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
      ~ tags                     = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                 = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy_auth must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy_auth" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy_auth:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "IDP_PROVIDER"
                          - value = "google"
                        },
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "debug"
                        },
                    ]
                  - essential        = true
                  - image            = "pomerium/verify:sha-6b38dd5"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/pomerium_sso_proxy_auth"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "pomerium_sso_proxy_auth-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "pomerium_sso_proxy_auth"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SHARED_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id"
                        },
                      - {
                          - name      = "COOKIE_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret"
                        },
                      - {
                          - name      = "IDP_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id"
                        },
                      - {
                          - name      = "IDP_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "pomerium_sso_proxy_auth" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      ~ tags                     = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                 = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_flow_log.cloud-based-sensor must be replaced
-/+ resource "aws_flow_log" "cloud-based-sensor" {
      ~ arn                      = "arn:aws:ec2:ca-central-1:794722365809:vpc-flow-log/fl-0b0e281579d3b2808" -> (known after apply)
      ~ id                       = "fl-0b0e281579d3b2808" -> (known after apply)
      + log_group_name           = (known after apply)
      ~ tags                     = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                 = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                   = "vpc-02034802b5547fd7d" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)

      - destination_options {
          - file_format                = "plain-text" -> null
          - hive_compatible_partitions = false -> null
          - per_hour_partition         = false -> null
        }
    }

  # aws_iam_policy.pomerium_policies will be updated in-place
  ~ resource "aws_iam_policy" "pomerium_policies" {
        id        = "arn:aws:iam::794722365809:policy/PomeriumSSOContainerExecutionPolicies"
        name      = "PomeriumSSOContainerExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/session_key",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/session_cookie_secret",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_secret",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_google_client_id",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_secret",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/pomerium_client_id",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags      = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
      ~ tags_all  = {
          ~ "Product"    = "security-tools" -> "security-tools-sso-proxy"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.write_waf_logs must be replaced
-/+ resource "aws_iam_policy" "write_waf_logs" {
      ~ arn         = "arn:aws:iam::794722365809:policy/security-tools_WriteLogs" -> (known after apply)
      ~ id          = "arn:aws:iam::794722365809:policy/security-tools_WriteLogs" -> (known after apply)
      ~ name        = "security-tools_WriteLogs" -> "security-tools-sso-proxy_WriteLogs" # forces replacement
      ~ policy      = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:ListBucketMultipartUploads",
                            "s3:ListBucket",
                            "s3:GetObject",
                            "s3:GetBucketLocation",
                            "s3:AbortMultipartUpload",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::cbs-satellite-794722365809/*"
                        Sid      = "S3PutObjects"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id   = "ANPA3SCJE6FY4FM7CQHMP" ->...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
